app/controllers/invents_controller.rb

  def index
    @invents = Invent.all
---
SELECT "invents".* FROM "invents"

  def create
    @invent = Invent.new(invent_params)

    respond_to do |format|
      if @invent.save
---
INSERT INTO "invents" ("name", "title", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "tingwei"], ["title", "The party!"], ["date", "2016-01-05"], ["created_at", "2016-01-05 03:56:14.140831"], ["updated_at", "2016-01-05 03:56:14.140831"]]

  def update
    respond_to do |format|
      if @invent.update(invent_params)
---
UPDATE "invents" SET "link" = ?, "updated_at" = ? WHERE "invents"."id" = ?  [["link", "http://stackoverflow.com/questions/530842/rails-modifying-a-model-generated-by-scaffolding"], ["updated_at", "2016-01-06 03:56:15.998356"], ["id", 11]]

  def destroy
    @invent.destroy
---
DELETE FROM "invents" WHERE "invents"."id" = ?  [["id", 4]]

    def set_invent
      @invent = Invent.find(params[:id])
---
SELECT  "invents".* FROM "invents" WHERE "invents"."id" = ? LIMIT 1  [["id", 9]]