app/controllers/simple_calendar_controller.rb

  def index
    @invents = Invent.all
---
SELECT "invents".* FROM "invents"